uhnp/src/Enums/СтатусыАкцизныхМарок/СтатусыАкцизныхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАкцизныхМарок</name>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>ВРезерве</name>
  </enumValues>
  <enumValues>
    <name>Реализована</name>
  </enumValues>
  <enumValues>
    <name>НеПодтверждена</name>
  </enumValues>
  <enumValues>
    <name>КПостановкеНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>ВНаличииКОтменеПроведения</name>
  </enumValues>
  <enumValues>
    <name>КПостановкеНаБалансКОтменеПроведения</name>
  </enumValues>
  <enumValues>
    <name>ВРезервеКОтменеПроведения</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаЧтенияСтатуса</name>
  </enumValues>
  <enumValues>
    <name>КСписанию</name>
  </enumValues>
  <enumValues>
    <name>КОприходованию</name>
  </enumValues>
  <enumValues>
    <name>ВскрытаяБутылка</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовЕГАИС</name>
  <enumValues>
    <name>АктТТН</name>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОФорматеОбмена</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийОтказ</name>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМОтменаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТранспортнойНакладной</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияВходящейТранспортнойНакладной</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПроизводствеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПроизводствеПереработка</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПроизводствеСырья</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияОтчетаОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПланируемомИмпорте</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияУведомленияОПланируемомИмпорте</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияОтчетаОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>АСИиУ</name>
  </enumValues>
  <enumValues>
    <name>ВскрытиеПотребительскойУпаковки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/АкцизныеМаркиЕГАИСУТКлиентСервер/Module.bsl
#Область СлужебныеПроцедурыИФункцииУТ

Процедура ЗаполнитьПараметрыСканированияЧекККМ(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества) Экспорт
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ВНаличии"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Продажа";
	
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСканированияЧекККМВозврат(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества) Экспорт
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.Реализована"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Возврат";
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
